(function ($) {
    if(!sessionStorage ||
        (!sessionStorage.getItem('userLogStatus') || !sessionStorage.getItem('loginUser') || !sessionStorage.getItem('token'))) {
        $(window.location).attr('href', '../../#/login');
        return;
    }
    var baseUrl = '/api/v1',
        rangeTime = 30*24*60;//临时：30天
        //rangeTime = 3(获取3分钟内的数据)
		var dataMap = [
			{name: '杭州市', value: 9, warn: 0},
			{name: '台州市', value: 9, warn: 0},
			{name: '宁波市', value: 9, warn: 0},
			{name: '天津市', value: 9, warn: 0},
			{name: '温州市', value: 9, warn: 0},
			{name: '南京市', value: 9, warn: 0},
			{name: '衢州市', value: 9, warn: 0},
			{name: '扬州市', value: 9, warn: 0},
			{name: '广州市', value: 9, warn: 0},
			{name: '长沙市', value: 9, warn: 0},
			{name: '丽水市', value: 9, warn: 0},
			{name: '湖州市', value: 9, warn: 0},
			{name: '金华市', value: 9, warn: 0},
			{name: '大连市', value: 9, warn: 0},
		];
	
		
		var geoCoordMap = {
			'北京市':[116.395645,39.929986],'上海市':[121.487899,31.249162],'天津市':[117.210813,39.14393],'重庆市':[106.530635,29.544606],'安徽市':[117.216005,31.859252],'合肥市':[117.282699,31.866942],'安庆市':[117.058739,30.537898],'蚌埠市':[117.35708,32.929499],'亳州市':[115.787928,33.871211],'巢湖市':[117.88049,31.608733],'池州市':[117.494477,30.660019],'滁州市':[118.32457,32.317351],'阜阳市':[115.820932,32.901211],'淮北市':[116.791447,33.960023],'淮南市':[117.018639,32.642812],'黄山市':[118.29357,29.734435],'六安市':[116.505253,31.755558],'马鞍山市':[118.515882,31.688528],'宿州市':[116.988692,33.636772],'铜陵市':[117.819429,30.94093],'芜湖市':[118.384108,31.36602],'宣城市':[118.752096,30.951642],'福建市':[117.984943,26.050118],'福州市':[119.330221,26.047125],'龙岩市':[117.017997,25.078685],'南平市':[118.181883,26.643626],'宁德市':[119.542082,26.656527],'莆田市':[119.077731,25.44845],'泉州市':[118.600362,24.901652],'三明市':[117.642194,26.270835],'厦门市':[118.103886,24.489231],'漳州市':[117.676205,24.517065],'甘肃市':[102.457625,38.103267],'兰州市':[103.823305,36.064226],'白银市':[104.171241,36.546682],'定西市':[104.626638,35.586056],'甘南州市':[102.917442,34.992211],'嘉峪关市':[98.281635,39.802397],'金昌市':[102.208126,38.516072],'酒泉市':[98.508415,39.741474],'临夏州市':[103.215249,35.598514],'陇南市':[104.934573,33.39448],'平凉市':[106.688911,35.55011],'庆阳市':[107.644227,35.726801],'天水市':[105.736932,34.584319],'武威市':[102.640147,37.933172],'张掖市':[100.459892,38.93932],'广东市':[113.394818,23.408004],'广州市':[113.30765,23.120049],'潮州市':[116.630076,23.661812],'东莞市':[113.763434,23.043024],'佛山市':[113.134026,23.035095],'河源市':[114.713721,23.757251],'惠州市':[114.410658,23.11354],'江门市':[113.078125,22.575117],'揭阳市':[116.379501,23.547999],'茂名市':[110.931245,21.668226],'梅州市':[116.126403,24.304571],'清远市':[113.040773,23.698469],'汕头市':[116.72865,23.383908],'汕尾市':[115.372924,22.778731],'韶关市':[113.594461,24.80296],'深圳市':[114.025974,22.546054],'阳江市':[111.97701,21.871517],'云浮市':[112.050946,22.937976],'湛江市':[110.365067,21.257463],'肇庆市':[112.479653,23.078663],'中山市':[113.42206,22.545178],'珠海市':[113.562447,22.256915],'广西市':[108.924274,23.552255],'南宁市':[108.297234,22.806493],'百色市':[106.631821,23.901512],'北海市':[109.122628,21.472718],'崇左市':[107.357322,22.415455],'防城港市':[108.351791,21.617398],'桂林市':[110.26092,25.262901],'贵港市':[109.613708,23.103373],'河池市':[108.069948,24.699521],'贺州市':[111.552594,24.411054],'来宾市':[109.231817,23.741166],'柳州市':[109.422402,24.329053],'钦州市':[108.638798,21.97335],'梧州市':[111.305472,23.485395],'玉林市':[110.151676,22.643974],'贵州市':[106.734996,26.902826],'贵阳市':[106.709177,26.629907],'安顺市':[105.92827,26.228595],'毕节地区市':[105.300492,27.302612],'六盘水市':[104.852087,26.591866],'铜仁地区市':[109.196161,27.726271],'遵义市':[106.93126,27.699961],'黔西南州市':[104.900558,25.095148],'黔东南州市':[107.985353,26.583992],'黔南州市':[107.523205,26.264536],'海南市':[109.733755,19.180501],'海口市':[110.330802,20.022071],'白沙市':[109.358586,19.216056],'保亭市':[109.656113,18.597592],'昌江市':[109.0113,19.222483],'儋州市':[109.413973,19.571153],'澄迈市':[109.996736,19.693135],'东方市':[108.85101,18.998161],'定安市':[110.32009,19.490991],'琼海市':[110.414359,19.21483],'琼中市':[109.861849,19.039771],'乐东市':[109.062698,18.658614],'临高市':[109.724101,19.805922],'陵水市':[109.948661,18.575985],'三亚市':[109.522771,18.257776],'屯昌市':[110.063364,19.347749],'万宁市':[110.292505,18.839886],'文昌市':[110.780909,19.750947],'五指山市':[109.51775,18.831306],'河北市':[115.661434,38.61384],'石家庄市':[114.522082,38.048958],'保定市':[115.49481,38.886565],'沧州市':[116.863806,38.297615],'承德市':[117.933822,40.992521],'邯郸市':[114.482694,36.609308],'衡水市':[115.686229,37.746929],'廊坊市':[116.703602,39.518611],'秦皇岛市':[119.604368,39.945462],'唐山市':[118.183451,39.650531],'邢台市':[114.520487,37.069531],'张家口市':[114.893782,40.811188],'河南市':[113.486804,34.157184],'郑州市':[113.649644,34.75661],'安阳市':[114.351807,36.110267],'鹤壁市':[114.29777,35.755426],'焦作市':[113.211836,35.234608],'开封市':[114.351642,34.801854],'洛阳市':[112.447525,34.657368],'漯河市':[114.046061,33.576279],'南阳市':[112.542842,33.01142],'平顶山市':[113.300849,33.745301],'濮阳市':[115.026627,35.753298],'三门峡市':[111.181262,34.78332],'商丘市':[115.641886,34.438589],'新乡市':[113.91269,35.307258],'信阳市':[114.085491,32.128582],'许昌市':[113.835312,34.02674],'周口市':[114.654102,33.623741],'驻马店市':[114.049154,32.983158],'黑龙江市':[128.047414,47.356592],'哈尔滨市':[126.657717,45.773225],'大庆市':[125.02184,46.596709],'大兴安岭地区市':[124.196104,51.991789],'鹤岗市':[130.292472,47.338666],'黑河市':[127.50083,50.25069],'鸡西市':[130.941767,45.32154],'佳木斯市':[130.284735,46.81378],'牡丹江市':[129.608035,44.588521],'七台河市':[131.019048,45.775005],'齐齐哈尔市':[123.987289,47.3477],'双鸭山市':[131.171402,46.655102],'绥化市':[126.989095,46.646064],'伊春市':[128.910766,47.734685],'湖北市':[112.410562,31.209316],'武汉市':[114.3162,30.581084],'鄂州市':[114.895594,30.384439],'恩施市':[109.517433,30.308978],'黄冈市':[114.906618,30.446109],'黄石市':[115.050683,30.216127],'荆门市':[112.21733,31.042611],'荆州市':[112.241866,30.332591],'潜江市':[112.768768,30.343116],'神农架林区市':[110.487231,31.595768],'十堰市':[110.801229,32.636994],'随州市':[113.379358,31.717858],'天门市':[113.12623,30.649047],'仙桃市':[113.387448,30.293966],'咸宁市':[114.300061,29.880657],'襄阳市':[112.176326,32.094934],'孝感市':[113.935734,30.927955],'宜昌市':[111.310981,30.732758],'湖南市':[111.720664,27.695864],'长沙市':[112.979353,28.213478],'常德市':[111.653718,29.012149],'郴州市':[113.037704,25.782264],'衡阳市':[112.583819,26.898164],'怀化市':[109.986959,27.557483],'娄底市':[111.996396,27.741073],'邵阳市':[111.461525,27.236811],'湘潭市':[112.935556,27.835095],'湘西州市':[109.745746,28.317951],'益阳市':[112.366547,28.588088],'永州市':[111.614648,26.435972],'岳阳市':[113.146196,29.378007],'张家界市':[110.48162,29.124889],'株洲市':[113.131695,27.827433],'江苏市':[119.368489,33.013797],'南京市':[118.778074,32.057236],'常州市':[119.981861,31.771397],'淮安市':[119.030186,33.606513],'连云港市':[119.173872,34.601549],'南通市':[120.873801,32.014665],'苏州市':[120.619907,31.317987],'宿迁市':[118.296893,33.95205],'泰州市':[119.919606,32.476053],'无锡市':[120.305456,31.570037],'徐州市':[117.188107,34.271553],'盐城市':[120.148872,33.379862],'扬州市':[119.427778,32.408505],'镇江市':[119.455835,32.204409],'江西市':[115.676082,27.757258],'南昌市':[115.893528,28.689578],'抚州市':[116.360919,27.954545],'赣州市':[114.935909,25.845296],'吉安市':[114.992039,27.113848],'景德镇市':[117.186523,29.303563],'九江市':[115.999848,29.71964],'萍乡市':[113.859917,27.639544],'上饶市':[117.955464,28.457623],'新余市':[114.947117,27.822322],'宜春市':[114.400039,27.81113],'鹰潭市':[117.03545,28.24131],'吉林市':[126.262876,43.678846],'长春市':[125.313642,43.898338],'白城市':[122.840777,45.621086],'白山市':[126.435798,41.945859],'吉林市市':[126.564544,43.871988],'辽源市':[125.133686,42.923303],'四平市':[124.391382,43.175525],'松原市':[124.832995,45.136049],'通化市':[125.94265,41.736397],'延边市':[129.485902,42.896414],'辽宁市':[122.753592,41.6216],'沈阳市':[123.432791,41.808645],'鞍山市':[123.007763,41.118744],'本溪市':[123.778062,41.325838],'朝阳市':[120.446163,41.571828],'大连市':[121.593478,38.94871],'丹东市':[124.338543,40.129023],'抚顺市':[123.92982,41.877304],'阜新市':[121.660822,42.01925],'葫芦岛市':[120.860758,40.74303],'锦州市':[121.147749,41.130879],'辽阳市':[123.172451,41.273339],'盘锦市':[122.073228,41.141248],'铁岭市':[123.85485,42.299757],'营口市':[122.233391,40.668651],'内蒙古市':[114.415868,43.468238],'呼和浩特市':[111.660351,40.828319],'阿拉善盟市':[105.695683,38.843075],'包头市':[109.846239,40.647119],'巴彦淖尔市':[107.423807,40.76918],'赤峰市':[118.930761,42.297112],'鄂尔多斯市':[109.993706,39.81649],'呼伦贝尔市':[119.760822,49.201636],'通辽市':[122.260363,43.633756],'乌海市':[106.831999,39.683177],'乌兰察布市':[113.112846,41.022363],'锡林郭勒盟市':[116.02734,43.939705],'兴安盟市':[122.048167,46.083757],'宁夏市':[106.155481,37.321323],'银川市':[106.206479,38.502621],'固原市':[106.285268,36.021523],'石嘴山市':[106.379337,39.020223],'吴忠市':[106.208254,37.993561],'中卫市':[105.196754,37.521124],'青海市':[96.202544,35.499761],'西宁市':[101.767921,36.640739],'果洛州市':[100.223723,34.480485],'海东地区市':[102.085207,36.51761],'海北州市':[100.879802,36.960654],'海南州市':[100.624066,36.284364],'海西州市':[97.342625,37.373799],'黄南州市':[102.0076,35.522852],'玉树州市':[97.013316,33.00624],'山东市':[118.527663,36.09929],'济南市':[117.024967,36.682785],'滨州市':[117.968292,37.405314],'东营市':[118.583926,37.487121],'德州市':[116.328161,37.460826],'菏泽市':[115.46336,35.26244],'济宁市':[116.600798,35.402122],'莱芜市':[117.684667,36.233654],'聊城市':[115.986869,36.455829],'临沂市':[118.340768,35.072409],'青岛市':[120.384428,36.105215],'日照市':[119.50718,35.420225],'泰安市':[117.089415,36.188078],'威海市':[122.093958,37.528787],'潍坊市':[119.142634,36.716115],'烟台市':[121.309555,37.536562],'枣庄市':[117.279305,34.807883],'淄博市':[118.059134,36.804685],'山西市':[112.515496,37.866566],'太原市':[112.550864,37.890277],'长治市':[113.120292,36.201664],'大同市':[113.290509,40.113744],'晋城市':[112.867333,35.499834],'晋中市':[112.738514,37.693362],'临汾市':[111.538788,36.099745],'吕梁市':[111.143157,37.527316],'朔州市':[112.479928,39.337672],'忻州市':[112.727939,38.461031],'阳泉市':[113.569238,37.869529],'运城市':[111.006854,35.038859],'陕西市':[109.503789,35.860026],'西安市':[108.953098,34.2778],'安康市':[109.038045,32.70437],'宝鸡市':[107.170645,34.364081],'汉中市':[107.045478,33.081569],'商洛市':[109.934208,33.873907],'铜川市':[108.968067,34.908368],'渭南市':[109.483933,34.502358],'咸阳市':[108.707509,34.345373],'延安市':[109.50051,36.60332],'榆林市':[109.745926,38.279439],'四川市':[102.89916,30.367481],'成都市':[104.067923,30.679943],'阿坝州市':[102.228565,31.905763],'巴中市':[106.757916,31.869189],'达州市':[107.494973,31.214199],'德阳市':[104.402398,31.13114],'甘孜州市':[101.969232,30.055144],'广安市':[106.63572,30.463984],'广元市':[105.819687,32.44104],'乐山市':[103.760824,29.600958],'凉山州市':[102.259591,27.892393],'泸州市':[105.44397,28.89593],'南充市':[106.105554,30.800965],'眉山市':[103.84143,30.061115],'绵阳市':[104.705519,31.504701],'内江市':[105.073056,29.599462],'攀枝花市':[101.722423,26.587571],'遂宁市':[105.564888,30.557491],'雅安市':[103.009356,29.999716],'宜宾市':[104.633019,28.769675],'资阳市':[104.63593,30.132191],'自贡市':[104.776071,29.359157],'西藏市':[89.137982,31.367315],'拉萨市':[91.111891,29.662557],'阿里地区市':[81.107669,30.404557],'昌都地区市':[97.185582,31.140576],'林芝地区市':[94.349985,29.666941],'那曲地区市':[92.067018,31.48068],'日喀则地区市':[88.891486,29.269023],'山南地区市':[91.750644,29.229027],'新疆市':[85.614899,42.127001],'乌鲁木齐市':[87.564988,43.84038],'阿拉尔市':[81.291737,40.61568],'阿克苏地区市':[80.269846,41.171731],'阿勒泰地区市':[88.137915,47.839744],'巴音郭楞市':[86.121688,41.771362],'博尔塔拉州市':[82.052436,44.913651],'昌吉州市':[87.296038,44.007058],'哈密地区市':[93.528355,42.858596],'和田地区市':[79.930239,37.116774],'喀什地区市':[75.992973,39.470627],'克拉玛依市':[84.88118,45.594331],'克孜勒苏州市':[76.137564,39.750346],'石河子市':[86.041865,44.308259],'塔城地区市':[82.974881,46.758684],'图木舒克市':[79.198155,39.889223],'吐鲁番地区市':[89.181595,42.96047],'五家渠市':[87.565449,44.368899],'伊犁州市':[81.297854,43.922248],'云南市':[101.592952,24.864213],'昆明市':[102.714601,25.049153],'保山市':[99.177996,25.120489],'楚雄州市':[101.529382,25.066356],'大理州市':[100.223675,25.5969],'德宏州市':[98.589434,24.44124],'迪庆州市':[99.713682,27.831029],'红河州市':[103.384065,23.367718],'丽江市':[100.229628,26.875351],'临沧市':[100.092613,23.887806],'怒江州市':[98.859932,25.860677],'普洱市':[100.980058,22.788778],'曲靖市':[103.782539,25.520758],'昭通市':[103.725021,27.340633],'文山市':[104.089112,23.401781],'西双版纳市':[100.803038,22.009433],'玉溪市':[102.545068,24.370447],'浙江市':[119.957202,29.159494],'杭州市':[120.219375,30.259244],'湖州市':[120.137243,30.877925],'嘉兴市':[120.760428,30.773992],'金华市':[119.652576,29.102899],'丽水市':[119.929576,28.4563],'宁波市':[121.579006,29.885259],'衢州市':[118.875842,28.95691],'绍兴市':[120.592467,30.002365],'台州市':[121.440613,28.668283],'温州市':[120.690635,28.002838],'舟山市':[122.169872,30.03601],'香港市':[114.186124,22.293586],'澳门市':[113.557519,22.204118],'台湾市':[120.961454,23.80406]
		};

	var convertData = function (data) {
		var res = [],colorValue;
		var normalColor = '#34cbff',
		warnColor = '#f35d40';
		for (var i = 0; i < data.length; i++) {
			var geoCoord = geoCoordMap[data[i].name];
			if (geoCoord) {
				if(data[i].warn){
				   colorValue = warnColor;
				}else{
				   colorValue = normalColor;
				}
				res.push({
					name: data[i].name,
					value: geoCoord.concat(data[i].value).concat(data[i].warn),
					itemStyle:{normal:{color:colorValue}}
				});
			}
		}
		return res;
	};

	var option = {
		backgroundColor: '#404a59',
		title: {
			text: '运维自动化监控',
			left: 'center',
			top:36,
			textStyle: {
				color: '#fff',
				fontSize: 24
			}
		},
		tooltip : {
			trigger: 'item',
			formatter: function (params) {
				var obj = params;//JSON.parse(JSON.stringify(params));
				var itemName = obj.name;
				var value = obj.value;
				var str = "<ur style='text-align:left;list-style:none;'><li style='font-weight:bolder;'>" + itemName + "</li>";
				str = str + "<li>共 " + value[2] + " 台OKP主机</li>";
				str = str + "<li>故障 <span style='color:#f35d40;'>" + value[3] + "</span> 台设备</li>";
				str = str + "</ul>";
				return str;
			}
		},
		legend: {
			orient: 'vertical',
			y: 'bottom',
			x:'right',
			data:['pm2.5'],
			textStyle: {
				color: '#fff'
			}
		},
		/*
		geo: {
			map: 'china',//浙江
			label: {
				emphasis: {
					show: false
				}
			},
			roam: true,
			itemStyle: {
				normal: {
					areaColor: '#323c48',
					borderColor: '#111'
				},
				emphasis: {
					areaColor: '#2a333d'
				}
			}
		},*/
		// config_
		bmap: {
			center: [120.219375,30.259244],
			zoom: 6,
			roam: true,  //支持滚轮放大缩小
			mapStyle: {
				styleJson: [
                {
                  'featureType': 'water',
                  'elementType': 'all',
                  'stylers': {
                    'color': '#00173D'
                  }
                },
                {
                  'featureType': 'land',
                  'elementType': 'geometry',
                  'stylers': {
                    'color': '#000004'
                  }
                },
                {
                  'featureType': 'highway',
                  'elementType': 'all',
                  'stylers': {
                    'visibility': 'off'
                  }
                },
                {
                  'featureType': 'arterial',
                  'elementType': 'geometry.fill',
                  'stylers': {
                    'color': '#000000'
                  }
                },
                {
                  'featureType': 'arterial',
                  'elementType': 'geometry.stroke',
                  'stylers': {
                    'color': '#365D7B'
                  }
                },
                {
                  'featureType': 'local',
                  'elementType': 'geometry',
                  'stylers': {
                    'color': '#000000'
                  }
                },
                {
                  'featureType': 'railway',
                  'elementType': 'geometry.fill',
                  'stylers': {
                    'color': '#000000'
                  }
                },
                {
                  'featureType': 'railway',
                  'elementType': 'geometry.stroke',
                  'stylers': {
                    'color': '#08304b'
                  }
                },
                {
                  'featureType': 'subway',
                  'elementType': 'geometry',
                  'stylers': {
                    'lightness': -70
                  }
                },
                {
                  'featureType': 'building',
                  'elementType': 'geometry.fill',
                  'stylers': {
                    'color': '#000000'
                  }
                },
                {
                  'featureType': 'all',
                  'elementType': 'labels.text.fill',
                  'stylers': {
                    'color': '#857f7f'
                  }
                },
                {
                  'featureType': 'all',
                  'elementType': 'labels.text.stroke',
                  'stylers': {
                    'color': '#000000'
                  }
                },
                {
                  'featureType': 'building',
                  'elementType': 'geometry',
                  'stylers': {
                    'color': '#022338'
                  }
                },
                {
                  'featureType': 'green',
                  'elementType': 'geometry',
                  'stylers': {
                    'color': '#062032'
                  }
                },
                {
                  'featureType': 'boundary',
                  'elementType': 'all',
                  'stylers': {
                    'color': '#365D7B'
                  }
                },
                {
                  'featureType': 'manmade',
                  'elementType': 'all',
                  'stylers': {
                    'color': '#022338'
                  }
                },
                {
                  'featureType': 'label',
                  'elementType': 'all',
                  'stylers': {
                    'visibility': 'off'
                  }
                },
				{
					"featureType": "label",
					"elementType": "labels.icon",
                    "stylers": {
                      "visibility": "off"
                    }
				}
			   ]
			}
		},
		series : [
			{
				name: '站点数量',
				type: 'scatter',
				coordinateSystem: 'bmap',
				// config_
				data: convertData(dataMap),
				symbolSize: function (val) {
					return 10**(val[2]/10 + 1);
				},
				label: {
					normal: {
						formatter: '{b}',
						position: 'right',
						show: true
					},
					emphasis: {
						show: true
					}
				},
				itemStyle: {
					normal: {
						color: '#ddb926'
					}
				}
			},{
				name: 'Top 5',
				type: 'effectScatter',
				coordinateSystem: 'bmap',
				// config_
				data: convertData(dataMap.sort(function (a, b) {
					return b.value - a.value;
				}).slice(0, 6)),
				symbolSize: function (val) {
					return 10**(val[2]/10 + 1);
				},
				showEffectOn: 'render',
				rippleEffect: {
					brushType: 'stroke'
				},
				hoverAnimation: true,
				label: {
					normal: {
						formatter: '{b}',
						position: 'right',
						show: true
					}
				},
				itemStyle: {
					normal: {
						color: '#f4e925',
						shadowBlur: 10,
						shadowColor: '#333'
					}
				},
				zlevel: 1
			}
		]
	};


	function getid(id){
		return document.getElementById(id);
	}

	//滚动栏部分-------------------//
	function mar(){
		if(t2.offsetTop<=t.scrollTop){
			t.scrollTop-=t1.offsetHeight;
		}else{
			t.scrollTop++;
		}
	}

	var t=getid("J_scroll"),t1=getid("J_scroll_info"),t2=getid("J_scroll_help"),timer;
	$(function(){
		$("#J_scroll").mouseover(function(){
		   clearInterval(timer);
		}).mouseout(function(){
		   timer=setInterval(mar,30)
		});
	})

	var structScrollInfo = function(arrInfo){
		$("#J_scroll_info").html(" ");
		clearInterval(timer);
		if(arrInfo.length==0){
		   arrInfo = [
				"Status of interface \"GigabitEthernet0/0/16\" was abnormal on Core_Switch_12.1.1.2",
				"\"2017-05-08 15:50:42\" \"sh-db-002\" \"Used space of file system\" /oracle was to high on 11gRAC",
				"\"2017-05-08 15:50:42\" \"sh-db-002\" \"Used space of file system\" /oracle was to high on 11gRAC",
				"\"2017-05-08 15:50:42\" \"sh-db-002\" \"Used space of file system\" /oracle was to high on 11gRAC",
				"\"2017-05-08 15:50:42\" \"sh-db-002\" \"Used space of file system\" /oracle was to high on 11gRAC",
				"\"2017-05-08 15:50:42\" \"sh-db-002\" \"Used space of file system\" /oracle was to high on 11gRAC"
		   ];
		}
		var ul = $("<ul></ul>");
		var li = null;
		var divTime = null;
		var divInfo = null;
		for(var i=0;  i<arrInfo.length;i++){
			li = $("<li></li>");
			divInfo = $("<div></div>");
			divInfo.html(arrInfo[i]);
			li.append(divInfo);
			ul.append(li);
		}
		$("#J_scroll_info").append(ul);
		t2.innerHTML=t1.innerHTML;
		timer=setInterval(mar,30);
	};

    //get key every 30min
    function getKeyTimmer(){
        $.ajax({
            type:"get",
            dataType: "json",
            url:baseUrl + "/partner/refresh",
            data:{},
            async:false,
            headers: {
                'Authorization' : 'Onekeeper '+sessionStorage.getItem('freshToken')
            },
            success:function(data){
                sessionStorage.setItem('token',data.data.access_token);
            },
            error:function(){
                console.log("系统程序错误！");
            }
        });
        setTimeout(getKeyTimmer,18000000)
    }

    //转换后台地图点接口数据
    function convertInterfaceData(data){
        var reArr = [];
        var objTemp = null;
        for(var i=0; i<data.length; i++){
            objTemp = {};
            objTemp.name = data[i].city_name;
            objTemp.value = parseInt(data[i].site_total);
            objTemp.warn = 0;
            reArr.push(objTemp);
        }
        return reArr;
    }

    //转换后台地图告警接口数据
    function convertWarnInfo(data){
        var reArr = [];
        var strTemp = '';
        for(var i=0; i < data.length; i++){
            strTemp = '';
            strTemp += '"'+transData(data[i].occure_at)+'"';
            strTemp += '"'+data[i].host+'"';
            strTemp += '"'+data[i].content+'"';
            reArr.push(strTemp);
        }
        return reArr;
    }

    //时间格式及+8
    function transData(time){
        time = time.replace(/-/g,'/');
        time = time.replace(/T/g,' ');
        var date = new Date (time);
        var year = date.getFullYear();
        date.setHours (date.getHours () + 8);
        var m = date.getMonth () + 1;
        m = m < 10 ? "0" + m : m;
        var d = date.getDate ();
        d = d < 10 ? "0" + d : d;
        var h = date.getHours ();
        h = h < 10 ? "0" + h : h;
        var mm = date.getMinutes ();
        mm = mm < 10 ? "0" + mm : mm;
        var ss = date.getSeconds ();
        ss = ss < 10 ? "0" + ss : ss;
        var res = year+ '-' +m + "-" + d + " " + h + ":" + mm+ ":"+ss;
        return res;
    }

    var chart = echarts.init( document.getElementById("J_map"));
    function getMapDataTimmer(){
        var tempArr = [];
        $.ajax({
            type: "get",
            dataType: "json",
            url: baseUrl + "/partner/states/allhosts",
            data: {},
            async: false,
            headers: {
                'Authorization': 'Onekeeper ' + sessionStorage.getItem('token')
            },
            success: function (data) {
                if(data && data.data) {
                    tempArr = convertInterfaceData(data.data);
                    option.series[0].data = convertData(tempArr);
                    getMapWarnDataTimmer(tempArr);
                }
            },
            error: function () {
                getMapWarnDataTimmer(dataMap);
                console.log("系统程序错误！");
            }
        });
        setTimeout(getMapDataTimmer,20000);
    }

    function getMapWarnDataTimmer(arr){
        $.ajax({
            type: "get",
            dataType: "json",
            url: baseUrl + "/partner/map/problemhosts?timedelta="+ rangeTime,
            data: {},
            async: false,
            headers: {
                'Authorization': 'Onekeeper ' + sessionStorage.getItem('token')
            },
            success: function (data) {
                if(data && data.data) {
                    for(var i=0; i<data.data.length; i++){
                        for(var j=0; j<arr.length; j++){
                            if(data.data[i].city_name == arr[j].name){
                                arr[j].warn = parseInt(data.data[i].site_total);
                            }
                        }
                    }
                    option.series[1].data = convertData(arr.sort(function (a, b) {
                        return b.value - a.value;
                    }).slice(0, 6));
                    chart.setOption(option);
                }
            },
            error: function () {
                chart.setOption(option);
                console.log("系统程序错误！");
            }
        });
    }

    function getScrollDataTimmer(){
        $.ajax({
            type: "get",
            dataType: "json",
            url: baseUrl + "/partner/map/contents?timedelta=" + rangeTime,
            data: {},
            async: false,
            headers: {
                'Authorization': 'Onekeeper ' + sessionStorage.getItem('token')
            },
            success: function (data) {
                if(data && data.data) {
                    structScrollInfo(convertWarnInfo(data.data));
                }
            },
            error: function () {
                structScrollInfo([]);
                console.log("系统程序错误！");
            }
        });
        setTimeout(getScrollDataTimmer,20000);
    }

    getMapDataTimmer();
    getScrollDataTimmer();
    getKeyTimmer();

})(jQuery);
